podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/RCM_MKL03Z4.svd.xml
<!--
Devices using this peripheral: 
      MKL03Z4
      MKL17Z4
      MKL17Z644
      MKL27Z4
      MKL27Z644
      MKL33Z4
      MKL43Z4
-->
      <peripheral>
         <?sourceFile "RCM_MKL03Z4" ?>
         <name>RCM</name>
         <description>Reset Control Module</description>
         <groupName>RCM</groupName>
         <headerStructName>RCM</headerStructName>
         <baseAddress>0x4007F000</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <?width "8" ?>
            <offset>0x0</offset>
            <size>0x2</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <?width "8" ?>
            <offset>0x4</offset>
            <size>0x6</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>SRS0</name>
               <description>System Reset Status Register 0\n
This register includes read-only status flags to indicate the source of the most recent reset</description>
               <addressOffset>0x0</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <resetValue>0x82</resetValue>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>WAKEUP</name>
                     <description>Low Leakage Wakeup\n
Indicates a reset has been caused by an enabled wakeup source while the chip was in a low leakage mode.\n
Any enabled wakeup source in a VLLSx mode causes a reset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Not active</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Reset by wakeup source</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LVD</name>
                     <description>Low-Voltage Detect\n
If PMC_LVDSC1[LVDRE] is set and the supply drops below the LVD trip voltage, an LVD reset occurs.
This field is also set by POR</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Not active</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Reset by LVD trip or POR</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WDOG</name>
                     <description>Watchdog\n
Indicates a reset has been caused by the watchdog timer timing out</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Not active</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Reset by watchdog</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PIN</name>
                     <description>External Reset Pin\n
Indicates a reset has been caused by an active-low level on the external RESET pin</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Not active</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Reset by reset pin</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>POR</name>
                     <description>Power-On Reset\n
Indicates a reset has been caused by the power-on detection logic.\n
The low-voltage reset (LVD) status bit will also be set</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Not active</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Power on Reset</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SRS1</name>
               <description>System Reset Status Register 1\n
This register includes read-only status flags to indicate the source of the most recent reset</description>
               <addressOffset>0x1</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>LOCKUP</name>
                     <description>Core Lockup\n
Indicates a reset has been caused by the ARM core indication of a LOCKUP event</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Not active</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>LOCKUP event</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SW</name>
                     <description>Software\n
Indicates a reset has been caused by software setting of SYSRESETREQ bit in Application Interrupt and
Reset Control Register in the ARM core</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Not active</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>SYSRESETREQ bit</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MDM_AP</name>
                     <description>MDM-AP System Reset Request\n
Indicates a reset has been caused by the host debugger system setting of the System Reset Request bit
in the MDM-AP Control Register</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Not active</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>System Reset Request</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SACKERR</name>
                     <description>Stop Mode ACK Error\n
Indicates that after an attempt to enter Stop mode, a reset has been caused by a failure of one or more
peripherals to acknowledge within approximately one second to enter stop mode</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Not active</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Reset by peripheral failure</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>RPFC</name>
               <description>Reset Pin Filter Control Register</description>
               <addressOffset>0x4</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>RSTFLTSRW</name>
                     <description>Reset Pin Filter Select in Run and Wait Modes\n
Selects how the reset pin filter is enabled in run and wait modes</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>All filtering disabled</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>Bus clock filter</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>LPO clock filter</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>Reserved</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RSTFLTSS</name>
                     <description>Reset Pin Filter Select in Stop Mode\n
Selects how the reset pin filter is enabled in low power modes.\n
On exit from VLLS mode, this bit should be reconfigured before clearing PMC_REGSC[ACKISO]</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Filtering disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>LPO clock filter</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>RPFW</name>
               <description>Reset Pin Filter Width Register</description>
               <addressOffset>0x5</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>RSTFLTSEL</name>
                     <description>Reset Pin Filter Bus Clock Select\n
Selects the reset pin bus clock filter width (1-32 bus clocks)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0bXXXXX</name>
                           <description>(N+1) Clock cycles</description>
                           <isDefault>true</isDefault>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>FM</name>
               <description>Force Mode Register</description>
               <addressOffset>0x6</addressOffset>
               <size>8</size>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>FORCEROM</name>
                     <description>Force ROM Boot\n
When either bit is set, will force boot from ROM during all subsequent system resets</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>No effect</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>Force boot from ROM with RCM_MR[1] set</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>Force boot from ROM with RCM_MR[2] set</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>Force boot from ROM with RCM_MR[2:1] set</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>MR</name>
               <description>Mode Register</description>
               <addressOffset>0x7</addressOffset>
               <size>8</size>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>BOOTROM</name>
                     <description>Boot ROM Configuration\n
Indicates the boot source, the boot source remains set until the next System Reset or software can write
logic one to clear the corresponding mode bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>Boot from Flash</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>Boot from ROM due to BOOTCFG0 pin assertion</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>Boot form ROM due to FOPT[7] configuration</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>Boot from ROM due to both BOOTCFG0 pin assertion and FOPT[7] configuration</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SSRS0</name>
               <description>Sticky System Reset Status Register 0\n
This register includes status flags to indicate the source of a reset since cleared\n
Flags are cleared by writing a logic one to the flag</description>
               <addressOffset>0x8</addressOffset>
               <size>8</size>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>SWAKEUP</name>
                     <description>Low Leakage Wakeup\n
Indicates a reset has been caused by an enabled wakeup source while the chip was in a low leakage mode.\n
Any enabled wakeup source in a VLLSx mode causes a reset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Not active</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Reset by wakeup source</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SLVD</name>
                     <description>Low-Voltage Detect\n
If PMC_LVDSC1[LVDRE] is set and the supply drops below the LVD trip voltage, an LVD reset occurs.
This field is also set by POR</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Not active</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Reset by LVD trip or POR</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SWDOG</name>
                     <description>Watchdog\n
Indicates a reset has been caused by the watchdog timer timing out</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Not active</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Reset by watchdog</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SPIN</name>
                     <description>External Reset Pin\n
Indicates a reset has been caused by an active-low level on the external RESET pin</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Not active</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Reset by reset pin</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SPOR</name>
                     <description>Power-On Reset\n
Indicates a reset has been caused by the power-on detection logic.\n
The low-voltage reset (LVD) status bit will also be set</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Not active</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Power on Reset</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
